{
    "<BOS>": 0,
    "<SEP>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "<PAD>": 4,
    "U12": 5,
    "U11": 6,
    "U10": 7,
    "U9": 8,
    "U8": 9,
    "U7": 10,
    "U6": 11,
    "U5": 12,
    "U4": 13,
    "U3": 14,
    "U2": 15,
    "U1": 16,
    "L12": 17,
    "L11": 18,
    "L10": 19,
    "L9": 20,
    "L8": 21,
    "L7": 22,
    "L6": 23,
    "L5": 24,
    "L4": 25,
    "L3": 26,
    "L2": 27,
    "L1": 28,
    "N12": 29,
    "N11": 30,
    "N10": 31,
    "N9": 32,
    "N8": 33,
    "N7": 34,
    "N6": 35,
    "N5": 36,
    "N4": 37,
    "N3": 38,
    "N2": 39,
    "N1": 40,
    "S12": 41,
    "S11": 42,
    "S10": 43,
    "S9": 44,
    "S8": 45,
    "S7": 46,
    "S6": 47,
    "S5": 48,
    "S4": 49,
    "S3": 50,
    "S2": 51,
    "S1": 52,
    "0": 53,
    "1": 54,
    "2": 55,
    "3": 56,
    "4": 57,
    "5": 58,
    "6": 59,
    "7": 60,
    "8": 61,
    "9": 62,
    "A": 63,
    "B": 64,
    "C": 65,
    "D": 66,
    "E": 67,
    "F": 68,
    "G": 69,
    "H": 70,
    "I": 71,
    "J": 72,
    "K": 73,
    "L": 74,
    "M": 75,
    "N": 76,
    "O": 77,
    "P": 78,
    "Q": 79,
    "R": 80,
    "S": 81,
    "T": 82,
    "U": 83,
    "V": 84,
    "W": 85,
    "X": 86,
    "Y": 87,
    "Z": 88,
    "a": 89,
    "b": 90,
    "c": 91,
    "d": 92,
    "e": 93,
    "f": 94,
    "g": 95,
    "h": 96,
    "i": 97,
    "j": 98,
    "k": 99,
    "l": 100,
    "m": 101,
    "n": 102,
    "o": 103,
    "p": 104,
    "q": 105,
    "r": 106,
    "s": 107,
    "t": 108,
    "u": 109,
    "v": 110,
    "w": 111,
    "x": 112,
    "y": 113,
    "z": 114,
    "!": 115,
    "\"": 116,
    "#": 117,
    "$": 118,
    "%": 119,
    "&": 120,
    "'": 121,
    "(": 122,
    ")": 123,
    "*": 124,
    "+": 125,
    ",": 126,
    "-": 127,
    ".": 128,
    "/": 129,
    ":": 130,
    ";": 131,
    "<": 132,
    "=": 133,
    ">": 134,
    "?": 135,
    "@": 136,
    "[": 137,
    "\\": 138,
    "]": 139,
    "^": 140,
    "_": 141,
    "`": 142,
    "{": 143,
    "|": 144,
    "}": 145,
    "~": 146
}